AhmedMesh1/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    CarBody.stl
    {
        type triSurfaceMesh;
        name CarBody_wall;
    }

    Splitter.stl
    {
        type triSurfaceMesh;
        name Splitter_wall;
    }

    Wing.stl
    {
        type triSurfaceMesh;
        name Wing_wall;
    }

    Upright.stl
    {
        type triSurfaceMesh;
        name Upright_wall;
    }

    RadBody.stl
    {
        type triSurfaceMesh;
        name RadBody_wall;
    }    

    FRTire.stl
    {
        type triSurfaceMesh;
        name FRTire_wall;
    }

    FRPlinth.stl
    {
        type triSurfaceMesh;
        name FRPlinth_wall;
    }

    RRTire.stl
    {
        type triSurfaceMesh;
        name RRTire_wall;
    }

    RRPlinth.stl
    {
        type triSurfaceMesh;
        name RRPlinth_wall;
    }

    FrontPlug.stl
    {
        type triSurfaceMesh;
        name rotatingZoneFront;
    }

    RearPlug.stl
    {
        type triSurfaceMesh;
        name rotatingZoneRear;
    }

    RadSurface.stl
    {
        type triSurfaceMesh;
        name RadSurface_wall;
    }  

    FinerefinementBox
    {
        type searchableBox;
        min (-3.0 0.0 0.0);
        max (7.0 2.0 2.0);
    }

    FloorBox
    {
        type searchableBox;
        min (-10.0 0.0 0.0); //for mini tunnel
        max ( 20.0 8.0 1.0);
    } 

    FineFloorBox
    {
        type searchableBox;
        min (-3.0 0.0 0.0);
        max (7.0 2.0 0.0625);
    }    
       
/*
    heatExchangerBox
    {
        type searchableBox;
        min (-1.22 0.00 1.02);
        max (-0.98 0.48 1.08);
    }
*/
}
// Settings for the castellatedMesh generation.
castellatedMeshControls
{
    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~
    maxLocalCells  1500000;
    maxGlobalCells 30000000;
    minRefinementCells 5; //stock is 10
    maxLoadUnbalance 0.05; //stock is .10
    nCellsBetweenLevels 5; //stock is 3
    // Explicit feature edge refinement
    // Specifies a level for any cell intersected by its edges.
    features
    (
        {
            file "CarBody.eMesh";
            level 9;
        }

        {
            file "Splitter.eMesh";
            level 9;
        }

        {
            file "Wing.eMesh";
            level 9;
        }

        {
            file "Upright.eMesh";
            level 9;
        }

        {
            file "RadBody.eMesh";
            level 9;
        }

        {
            file "RadSurface.eMesh";
            level 9;
        }

        {
            file "FRTire.eMesh";
            level 9;
        }

        {
            file "FRPlinth.eMesh";
            level 9;
        }

        {
            file "RRTire.eMesh";
            level 9;
        }

        {
            file "RRPlinth.eMesh";
            level 9;
        }

        {
            file "FrontPlug.eMesh";
            level 9;
        }

        {
            file "RearPlug.eMesh";
            level 9;
        }
    );
     refinementSurfaces

/*cellsize calc:
1 meter block

refine level 1= .5m
refine level 2= .25m
refine level 3= .125m
refine level 4= .0625m
refine level 5= .03125m
refine level 6= .015625m
refine level 7= .0078125m
refine level 8= .00390625m
refine level 9= .001953125m
refine level 10= .0009765625m

*/

    {
        CarBody_wall
        {
            level (7 8); //this is the global refinement of the STL geo
            patchInfo
            {
                type wall;
                inGroups (carGroup);
            }                                 
        }

        Splitter_wall
        {
            level (8 8); //this is the global refinement of the STL geo
            patchInfo
            {
                type wall;
                inGroups (carGroup);
            }                                 
        } 

        Wing_wall
        {
            level (8 8); //this is the global refinement of the STL geo
            patchInfo
            {
                type wall;
                inGroups (carGroup);
            }                                 
        }     

        Upright_wall
        {
            level (8 8); //this is the global refinement of the STL geo
            patchInfo
            {
                type wall;
                inGroups (carGroup);
            }                                 
        } 

        RadBody_wall
        {
            level (6 7); //this is the global refinement of the STL geo
            patchInfo
            {
                type wall;
                inGroups (carGroup);
            }                                 
        }    

        FRPlinth_wall
        {
            level (9 9); //this is the global refinement of the STL geo
            patchInfo
            {
                type wall;
                inGroups (carGroup);
            }                                 
        } 

        RRPlinth_wall
        {
            level (9 9); //this is the global refinement of the STL geo
            patchInfo
            {
                type wall;
                inGroups (carGroup);
            }                                 
        } 

        FRTire_wall
        {
            level (7 8); //this is the global refinement of the STL geo
            patchInfo
            {
                type wall;
                inGroups (tireGroup);
            }                                 
        } 

        RRTire_wall
        {
            level (7 8); //this is the global refinement of the STL geo
            patchInfo
            {
                type wall;
                inGroups (tireGroup);
            }                                 
        } 

        RadSurface_wall
        {
            level (7 7);
            cellZone heatExchanger;
            faceZone heatExchangerf;
            cellZoneInside  inside; 
        }
        
        rotatingZoneFront
        {
            level       (8 8);
            faceZone    rotatingZoneFront;
            cellZone    rotatingZoneFront;
            cellZoneInside  inside;                             
        }  

        rotatingZoneRear
        {
            level       (8 8);
            faceZone    rotatingZoneRear;
            cellZone    rotatingZoneRear;
            cellZoneInside  inside;                             
        }  
    }                            
    // Resolve sharp angles
    resolveFeatureAngle 1; //30 is stock, lets try 1
    // Region-wise refinement
refinementRegions
    {
        FloorBox
        {
            mode inside;
            levels ((1E15 1));
        }

        FineFloorBox
        {
            mode inside;
            levels ((1E15 6));
        }
                
        FinerefinementBox
        {
            mode inside;
            levels ((1E15 5));
        }

        CarBody_wall
        {
            mode distance;
            levels ((.25 5) (.5 4) (.75 3)); // levels must be ordered nearest first
        }    

        rotatingZoneFront
        {
            mode inside;
            levels ((1E15 4));
        }  

        rotatingZoneRear
        {
            mode inside;
            levels ((1E15 4));
        }           
    }
/////////////////////////////////////////////////////////////////////////////////////////////////////
    // Mesh selection
    // ~~~~~~~~~~~~~~
    locationInMesh (3.9001 3.9001 0.43);
    allowFreeStandingZoneFaces true;
}

// Settings for the snapping.
snapControls
{
    nSmoothPatch 5; //3 is stock, 5 reccomended from Simscale
    tolerance 5.0; //2.0 is stock, 5 reccomended from Simscale
    nSolveIter 400; // 30 is stock 300 from wolf dynamics
    nRelaxIter 12; //simscale says 5-8
    nFeatureSnapIter 20; //10 is stock 20 from wolf
    implicitFeatureSnap false;
    explicitFeatureSnap true; //this will snap to the surface feature extract
    multiRegionFeatureSnap true; //stock is flase
}

addLayersControls
{
    relativeSizes true;
    nSurfaceLayers 3;
    expansionRatio 1.2;
    finalLayerThickness 0.3;
    //firstLayerThickness 0.001;
    //thickness 0.6;
    minThickness 0.01;
    
    // Per final patch (so not geometry!) the layer information
    //https://en.wikipedia.org/wiki/Law_of_the_wall
    layers
    {
        "(carGroup).*"
        {
            nSurfaceLayers 4;
            //expansionRatio 1.3;
            //finalLayerThickness 0.3;
            //minThickness 0.001;
        }
        "(tireGroup).*"
        {
            nSurfaceLayers 4;
            //expansionRatio 1.3;
            //finalLayerThickness 0.3;
            //minThickness 0.001;
        }
        lowerWall
        {
            nSurfaceLayers 3;
            //expansionRatio 1.3;
            //finalLayerThickness 0.3;
            //minThickness 0.002;
        }
    }
    nGrow 0;
    featureAngle 180; //180 is stock 130 from wolf try 1 from intel
    slipFeatureAngle 75; //75 stock 30 from wolf
    nRelaxIter 10; //8 is stock 10 from wolf
    nSmoothSurfaceNormals 5; //1 is stock
    nSmoothNormals 10; //5 is stock, 10 from wolf
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 1.0; //.35 stock .3 from wolf //1 from intel
    minMedianAxisAngle 90; //90 is stock
    minMedialAxisAngle 90; //90 is stock
    nBufferCellsNoExtrude 0;
    nLayerIter 90; //50 is stock //90 wolf
}

meshQualityControls
{
    #include "meshQualityDict"
}

// Advanced

// Write flags
writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);

// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;


// ************************************************************************* //
